;***************************************
;New Ability Descriptions
;***************************************

[RustyPanacea X2AbilityTemplate]
LocFriendlyName="Panacea Cleansing"
LocLongDescription="Heal an allies mind with psionic power."
LocHelpText="Heal an allies mind with psionic power."
LocFlyOverText="Panacea Cleansing"
LocPromotionPopupText="<Bullet/>Heal an allies body and mind with psionic power. Removes most mental and environmental effects.<br/><Bullet/>Grants the target <Ability:PANACEA_APGRANTED/> standard actions.<br/><Bullet/> Uses <Ability:PANACEA_COST_AP/> AP.<br/><Bullet/> Has a <Ability:PANACEA_COST_COOLDOWN/> turn cooldown.<br/><Bullet/> Is a free action :<Ability:PANACEA_COST_FREE/>.<br/><Bullet/> Is turn ending : <Ability:PANACEA_COST_TURNENDING/>"

[RustyPsiHeal X2AbilityTemplate]
LocFriendlyName="Soul Mend"
LocLongDescription="Heal an allies body with psionic power."
LocHelpText="Heal an allies body with psionic power."
LocFlyOverText="Soul Mend"
LocPromotionPopupText="<Bullet/>Heal an allies body with psionic power. Acts just like a medikit but from the <Ability:ClassName/>'s mind.<br/><Bullet/>Uses <Ability:PSIHEAL_COST_AP/> AP.<br/><Bullet/> Has a <Ability:PSIHEAL_COST_COOLDOWN/> turn cooldown.<br/><Bullet/> Is a free action :<Ability:PSIHEAL_COST_FREE/>.<br/><Bullet/> Is turn ending : <Ability:PSIHEAL_COST_TURNENDING/>"

[RustySixthSense X2AbilityTemplate]
LocFriendlyName="Sixth Sense"
LocLongDescription="Able to predict attacks. Gain <Ability:SSDODGE/> dodge for <Ability:SSTURN/> turn(s) after being revealed."
LocHelpText="Gain <Ability:SSDODGE/> dodge for <Ability:SSTURN/> turn(s) after being revealed."
LocFlyOverText="Sixth Sense"

[SixthSense_Passive X2AbilityTemplate]
LocFriendlyName="Sixth Sense"
LocLongDescription="Able to predict attacks. Gain <Ability:SSDODGE/> dodge for <Ability:SSTURN/> turn(s) after being revealed. Can re-conceal in mission."
LocHelpText="Gain <Ability:SSDODGE/> dodge for <Ability:SSTURN/> turn(s) after being revealed. Can re-conceal in mission."
LocFlyOverText="Sixth Sense"

[SixthSense_Stealth X2AbilityTemplate]
LocFriendlyName="Sixth Sense Shadow"
LocLongDescription="Immediately enter concealment."
LocHelpText="Immediately enter concealment."
LocFlyOverText="Sixth Sense Shadow"
LocPromotionPopupText="<Bullet/> Concealment can be entered at any location, but when done inside the detection radius of nearby enemies the <Ability:ClassName/> will be revealed if flanked.<br/>"

;***************************************
;GTS - DEFAULT UNLOCK AT RANK 4
;***************************************

[Rusty_SixthSenseUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Psionic: Sixth Sense"
Summary="Gain dodge after breaking concealment. Also gain a single use re-conceal in any missions."

;****************************************************
;	PSIONCS CLASS LOCALISATION
;****************************************************

;*** Encyclopedia Entry ***
[RustyPsionic X2EncyclopediaTemplate]
ListTitle = "Psionic Operatives"
DescriptionTitle = "Psionics Operatives"
DescriptionEntry = "A mysterious new branch of study for XCOM, the Psionics utilize their mental abilities to great effect to boosting their allies and crippling the will of enemies."

[RustyPsionic X2SoldierClassTemplate]
DisplayName="Psionic"
ClassSummary="A mysterious new branch of study for XCOM, the Psionics utilize their mental abilities to great effect to boosting their allies and crippling the will of enemies."

;old tree style
LeftAbilityTreeTitle="Telepath"
RightAbilityTreeTitle="Resonant"

;npsbd tree style
AbilityTreeTitles[0]="Telepath"
AbilityTreeTitles[1]="Resonant"
AbilityTreeTitles[2]="Iridian"
AbilityTreeTitles[3]="XCOM"

;ALPHABETICAL NICKNAMES OR THEY DONT WORK !
RandomNickNames[0]="Crow"
RandomNickNames[1]="Demon"
RandomNickNames[2]="Dirge"
RandomNickNames[3]="Dread"
RandomNickNames[4]="Druid"
RandomNickNames[5]="Dusk"
RandomNickNames[6]="Echo"
RandomNickNames[7]="Ecto"
RandomNickNames[8]="Firefly"
RandomNickNames[9]="Freak"
RandomNickNames[10]="Ghoul"
RandomNickNames[11]="Grim"
RandomNickNames[12]="Haze"
RandomNickNames[13]="Hellion"
RandomNickNames[14]="Hex"
RandomNickNames[15]="Judge"
RandomNickNames[16]="Midnight"
RandomNickNames[17]="Nightmare"
RandomNickNames[18]="Null"
RandomNickNames[19]="Ouija"
RandomNickNames[20]="Omega"
RandomNickNames[21]="Omen"
RandomNickNames[22]="Oz"
RandomNickNames[23]="Phoenix"
RandomNickNames[24]="Prophet"
RandomNickNames[25]="Psycho"
RandomNickNames[26]="Raven"
RandomNickNames[27]="Scarecrow"
RandomNickNames[28]="Shriek"
RandomNickNames[29]="Spook"
RandomNickNames[30]="Syndrome"
RandomNickNames[31]="Thriller"
RandomNickNames[32]="Twitch"
RandomNickNames[33]="Vader"
RandomNickNames[34]="Vampire"
RandomNickNames[35]="Viper"
RandomNickNames[36]="Voodoo"
RandomNickNames[37]="Warlock"
RandomNickNames[38]="Werewolf"
RandomNickNames[39]="Witchy"
RandomNickNames[40]="Wiz"
RandomNickNames[41]="Xeno"
RandomNickNames[42]="Zen"
RandomNickNames[43]="Zero"
RandomNickNames[44]="Zombie"

RandomNickNames_Male[0]="Loki"
RandomNicknames_Male[1]="Merlin"
RandomNickNames_Male[2]="Pharoah"
RandomNicknames_Male[3]="Preacher"

RandomNicknames_Female[0]="Aurora"
RandomNicknames_Female[1]="Banshee"
RandomNickNames_Female[2]="Lady Grey"
RandomNicknames_Female[3]="Misery"
RandomNicknames_Female[4]="Morrigan"
RandomNicknames_Female[5]="Oracle"
RandomNicknames_Female[6]="Sorceress"
RandomNicknames_Female[7]="Violet"

; RANK NAMES AND ICONS
RankNames[0]="Rookie"
RankNames[1]="Initiate"
RankNames[2]="Adept"
RankNames[3]="Acolyte"
RankNames[4]="Mystic"
RankNames[5]="Disciple"
RankNames[6]="Seraphim"
RankNames[7]="Magus"
;RankNames[8]="Void"

ShortNames[0]="Rk."
ShortNames[1]="Int."
ShortNames[2]="Adp."
ShortNames[3]="Acl."
ShortNames[4]="Mys."
ShortNames[5]="Dis."
ShortNames[6]="Ser."
ShortNames[7]="Mag."
;ShortNames[8]="Vd."

;re-arranged to better match the ranks abilities
RankIcons[0]= "UILibrary_Common.rank_rookie"
RankIcons[1]= "UILibrary_Common.psirank_initiate"
RankIcons[2]= "UILibrary_Common.psirank_adept"
RankIcons[3]= "UILibrary_Common.psirank_acolyte"
RankIcons[4]= "UILibrary_Common.psirank_mystic"
RankIcons[5]= "UILibrary_Common.psirank_disciple"
RankIcons[6]= "UILibrary_Common.psirank_warlock"
RankIcons[7]= "UILibrary_Common.psirank_magus"
;RankIcons[8]= "UILibrary_RustyPsionic.psirank_void"

;PHOTOBOTH QUOTES
PhotoboothSoloBLines_Male[0]="His greatest weapon ... IS HIS MIND!"
PhotoboothSoloBLines_Female[0]="Her greatest weapon ... IS HER MIND!"
